---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsError
source: html/31927be0-218f-31fd-c52b-7af3c38afca3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsError Property

There was not enough room to place the required fittings. Consider increasing the length of the segments,
 or moving them farther apart to generate a solution.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughRoomForFittingsError { get; }
```